# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\Workspace\psoc4\PWM_Fade_Ex\PWMExample01\PWMExample01.cydsn\PWMExample01.cyprj
# Date: Sat, 01 Nov 2014 00:00:46 GMT
#set_units -time ns
create_clock -name {Clock_1(FFB)} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/ff_div_8}]]
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 3 5} [list]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]


# Component constraints for D:\Workspace\psoc4\PWM_Fade_Ex\PWMExample01\PWMExample01.cydsn\TopDesign\TopDesign.cysch
# Project: D:\Workspace\psoc4\PWM_Fade_Ex\PWMExample01\PWMExample01.cydsn\PWMExample01.cyprj
# Date: Sat, 01 Nov 2014 00:00:44 GMT
